// 1. Дан случайный массив чисел (создайте самостоятельно).
// С помощью метода `.filter()` отфильтруйте массив так,
// чтобы в новый массив вошли только четные двухзначные числа из исходного.

// let arr = [3, 45, 66, 77, 9, 13, 42, 64, 8, 22, 102, 98, 10];

// const sortedArr = arr.filter((item) => {
//   if (item % 2 === 0 && item > 9 && item < 100) {
//     return true;
//   } else {
//     return false;
//   }
// });

// console.log(sortedArr);

//===================================================================================================

// 2. Пользователь вводит 10 случайных значений. Каждое
// значение необходимо записать в массив. С помощью
// метода `.every()` проверить были ли все введенные
// пользователем данные – числами.

// let someArr = [];
// for (let i = 0; i < 5; i++) {
//   someArr.push(prompt("Input any dates"));
// }
// console.log(someArr);

// const result = someArr.every((inData) => {
//   if (
//     typeof Number(inData) === "number" &&
//     isNaN(inData) === false &&
//     inData !== null &&
//     inData !== ""
//   ) {
//     console.log(inData);
//     return true;
//   } else {
//     console.log(`${inData} - is not a number`);
//     return false;
//   }
// });
// console.log(result);
// ===================================================================================================

// // 3. Дан массив объектов
// // ```js
// const arr = [
//   { a: 2, b: 1 },
//   { a: 5, b: 12 },
//   { a: 95, b: 7 },
// ];

// // ```
// // Используя ТОЛЬКО методы массивов (циклы запрещены):
// // - Вывести в консоль `'its valid'`, если во всех объектах поле `a > b`, вывести `'its invalid'` если хотя бы в одном объекте `a<=b`

// const result = arr.every((item) => {
//   if (item.a > item.b) {
//     return true;
//   } else {
//     console.log("its invalid");
//     return false;
//   }
// });
// if (result === true) {
//   console.log("its valid");
// }

//==============================================================

// - На основе массива arr, создать массив объектов у которых поле b возведено в квадрат
// пример:
// ```js
// const arr2 = [
//   {a: 2, b: 1},
//   {a: 5, b: 144},
//   {a: 95, b: 49}
// ];
// ```

// const arr2 = arr.map(({ b, ...item }) => {
//   return {
//     ...item,
//     b: b ** 2,
//   };
// });
// console.log(arr2);

//================================================================